Revit 2027 API
ExternalServices.BuiltInExternalServices.IFCEntityTreeUIService Property
 The UI service which permits registration of an external server for new UI managing IFCEntity Selection
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId IFCEntityTreeUIService { get; }
Public Shared ReadOnly Property IFCEntityTreeUIService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ IFCEntityTreeUIService {
	ExternalServiceId^ get ();
}
static member IFCEntityTreeUIService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace